
function validate_form_add_breach ( )
{   
	valid = true;
    
    var num_contract = document.getElementById("breach-num_contract").value;
    
    var num_pp = document.getElementById("breach_num_pp").value;
    
    var date_pp = document.getElementById("breach-add-date-pp").value;
    
    var date_provide_pp = document.getElementById("breach-add-date-provide-pp").value;
    
    var date_doc = document.getElementById("breach-add-date-doc").value;
    
    var date_accept = document.getElementById("breach-add-date-accept").value;
    
    var date_provision = document.getElementById("breach-add-date-provision").value;
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    var patt_num_contract = /^[а-яА-Я\d\-\/]{8,20}$/;
    
    var patt_num_pp = /^[\d]{3,10}$/;
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    
    if ( num_contract == "" )
    {
        alert ( "Пожалуйста заполните поле '№ контракта'." );
        valid = false;
        return valid;
    }
    else if(patt_num_contract.test(num_contract) == false)
    {
        alert ( "Введеное значение в поле '№ контракта' указано неправильно. \nРазрешен ввод всех цифр, всех букв кириллицы (кроме 'ё') а также спец. символов <->, </>, длинной не менее 8 и не более 20 символов. \nПримеры разрешенного ввода: 0027/Э-22, 0351100002722000139." );
        valid = false;
        return valid;
    }
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/ 
    if ( num_pp == "" )
    {
        alert ( "Пожалуйста заполните поле '№ п/п'." );
        valid = false;
        return valid;
    }
    else if(patt_num_pp.test(num_pp) == false)
    {
        alert ( "Введеное значение в поле '№ п/п' указано неправильно. \nРазрешен ввод всех цифр, длинной не менее 3 и не более 10 символов. \nПримеры разрешенного ввода: 7180, 443070." );
        valid = false;
        return valid;
    }
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/ 
    if (date_pp == ""){
        alert ( "Пожалуйста заполните поле 'Дата п/п'." );
        valid = false;
        return valid;
    }
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    if (date_provide_pp == ""){
        alert ( "Пожалуйста заполните поле 'Дата предоставления п/п'." );
        valid = false;
        return valid;
    }
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    if (date_doc == ""){
        alert ( "Пожалуйста заполните поле 'Дата документа'." );
        valid = false;
        return valid;
    }
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    if (date_accept == ""){
        alert ( "Пожалуйста заполните поле 'Дата приемки'." );
        valid = false;
        return valid;
    }
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    if (date_provision == ""){
        alert ( "Пожалуйста заполните поле 'Дата предоставления'." );
        valid = false;
        return valid;
    }
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

    return valid;
}

function validate_form_delete_breach ( )
{
	valid = true;
    
    var delete_num = document.getElementById("reestr-delete").value;

    var patt_delete = /^[\d]{1,3}$/;

    if ( delete_num == "" )
    {
        alert ( "Пожалуйста заполните поле 'Номер строки'." );
        valid = false;
    }
    else if(patt_delete.test(delete_num) == false){
        alert("Номер строки введен в неправильном формате. Он должна состоять не менее из 1 и не более из 3 цифр. ");
        valid = false;
    }
    
    if(valid == true){
        alert("Запись успешно удалена!");
    }

    return valid;
}