
function validate_form_add_fbu ( )
{   
	valid = true;

    var date = document.getElementById("fbu-add-date").value;
    
    var num_contract = document.getElementById("fbu-add-num-contr").value;
    
    var name = document.getElementById("fbu-add-name").value;
    
    var fact = document.getElementById("fbu-add-fact").value;
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    var patt_num_contract = /^[а-яА-Я\d\-\/]{8,20}$/;
    
    var patt_name = /^[а-яА-Я\d\.\,\:\s]{10,250}$/;

    var patt_fact = /^[а-яА-Я\d\.\,\:\s]{10,250}$/;
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    if (date == ""){
        alert ( "Пожалуйста заполните поле 'Дата'." );
        valid = false;
        return valid;
    }
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/ 
    if ( num_contract == "" )
    {
        alert ( "Пожалуйста заполните поле '№ контракта'." );
        valid = false;
        return valid;
    }
    else if(patt_num_contract.test(num_contract) == false)
    {
        alert ( "Введеное значение в поле '№ контракта' указано неправильно. \nРазрешен ввод всех цифр, всех букв кириллицы (кроме 'ё') а также спец. символов <->, </>, длинной не менее 8 и не более 20 символов. \nПримеры разрешенного ввода: 0027/Э-22, 0351100002722000139." );
        valid = false;
        return valid;
    }
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/ 
    if ( name == "" )
    {
        alert ( "Пожалуйста заполните поле 'Наименование'." );
        valid = false;
        return valid;
    }
    else if(patt_name.test(name) == false)
    {
        alert ( "Введеное значение в поле 'Наименование' указано неправильно. \nРазрешен ввод всех цифр, всех букв кириллицы (кроме 'ё') а также спец. символов <,>, <.>, <:>, длинной не менее 10 и не более 250 символов." );
        valid = false;
        return valid;
    }
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    if ( fact == "" )
    {
        alert ( "Пожалуйста заполните поле 'Факт'." );
        valid = false;
        return valid;
    }
    else if(patt_fact.test(fact) == false)
    {
        alert ( "Введеное значение в поле 'Факт' указано неправильно. \nРазрешен ввод всех цифр, всех букв кириллицы (кроме 'ё') а также спец. символов <,>, <.>, <:>, длинной не менее 10 и не более 250 символов." );
        valid = false;
        return valid;
    }
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

    return valid;
}

function validate_form_delete_fbu ( )
{
	valid = true;
    
    var delete_num = document.getElementById("fbu-delete").value;

    var patt_delete = /^[\d]{1,3}$/;

    if ( delete_num == "" )
    {
        alert ( "Пожалуйста заполните поле 'Номер строки'." );
        valid = false;
    }
    else if(patt_delete.test(delete_num) == false){
        alert("Номер строки введен в неправильном формате. Он должна состоять не менее из 1 и не более из 3 цифр. ");
        valid = false;
    }
    
    if(valid == true){
        alert("Запись успешно удалена!");
    }

    return valid;
}